---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ExtrusionAutoParams
source: html/151c94fa-c29e-d796-f5a3-59c22c440846.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ExtrusionAutoParams Property

"Auto ends"

## Syntax (C#)
```csharp
public static ForgeTypeId ExtrusionAutoParams { get; }
```